Ah thank you, that made it possible to use the plugin.

I am encountering an issue where the constraint doesn't seem to be set:

```bash
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_model.githubrunners will be created
  + resource "juju_model" "githubrunners" {
      + constraints = "mem=70G cores=18 root-disk=1000G"
      + id          = (known after apply)
      + name        = "prod-github-runner"
      + type        = (known after apply)

      + cloud {
          + name   = (known after apply)
          + region = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

juju_model.githubrunners: Creating...
juju_model.githubrunners: Creation complete after 0s [id=6bc79e80-b41c-4776-8e9f-0feaa1871556]

juju get-model-constraints -m prod-github-runner

```